Revit 2026 API

# ElementDesignOptionFilter Class

---

A filter used to find elements contained within a particular design option.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementDesignOptionFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementDesignOptionFilter : ElementQuickFilter
```
```vb
Public Class ElementDesignOptionFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementDesignOptionFilter : public ElementQuickFilter
```
```fsharp
type ElementDesignOptionFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementDesignOptionFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementDesignOptionFilter(ElementId) | Constructs a new instance of a filter to match elements contained within a particular design option. |
|  | ElementDesignOptionFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option. |

|  | Name | Description |
| --- | --- | --- |
|  | DesignOptionId | The design option id. |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. (Inherited from ElementFilter) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ElementFilter) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ElementFilter) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | PassesFilter(Element) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. (Inherited from ElementFilter) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace